/*
1. 整型
Go中提供了 int8 int16 int32 int64 / uint8 uint16 uint32 uint64四种不同大小的有符号和无符号整数类型
以及两种大小取决与特定CPU的有符号和无符号整数int uint。对于有符号整型，其值域为-2^n-1 ~ 2^n-1 - 1，而
无符号整型的值域为0 ~ 2^n - 1

1.1 位操作符
var x,y uint8 = 5,2  // 5 == 0000 0101; 2 == 0000 0010

&  与运算：z = x & y  --->  z = 0000 0000
|  或运算：z = x | t  --->  z = 0000 0111
^  二元运算符时为按位异或：z = x ^ y  --->  z = 0000 0111；一元运算符时为按位取反：^x = 1111 1010
&^ 按位置零：z = x &^ y  ---> z = 0000 0101(将y中为1的bit位时，z对应的bit位置0,否则z中对应bit位等于x对应的bit位)
<< 左移
>> 右移
*/

package ch3

func test() {

}
